app/controllers/questions_controller.rb

  def test
    true_false_count = Option.get "true_false_questions_count"
    multi_choice_count = Option.get "multi_choice_questions_count"
    begin
      @true_false = TrueFalseQuestion.verified.limit(true_false_count).order("RANDOM()")
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "questions" WHERE "questions"."type" IN ('TrueFalseQuestion') AND (verified = 't') LIMIT 20) subquery_for_count